# ICN Programming Course

<p align="center">
    <img width="500" alt="image" src="https://github.com/Lenakeiz/ICN_Programming_Course/blob/main/Images/cog_neuro_logo_blue_png_0.png?raw=true">
</p>

---

## Pandas
In this part of the lesson we are going to present one of the tools you will most likely use for .

[Pandas library](https://pandas.pydata.org/) defines and makes use of a new _data structure_, _i.e._ the `DataFrame`. 
Actually pandas define more than just a data structure, for instance we will make use of `Series` and examine the difference with dataframes.

### Advantages of pandas

Data scientists use Pandas for its following advantages:

* Easily handles missing data;
* It provides an efficient way to slice the data;
* It provides a flexible way to merge, concatenate or reshape the data;
* It includes a powerful data casting tool to work with;
* It wraps data visualisation libraries in order to quickly plotting analysis results.

Tthe main disadvantage of pandas is that it is relegated to manipulate dataframes whose dimension is strictly lower than memory.
### Dataframes

A `DataFrame` is a table. As any other type in python, it is defined as a class, with its attributes and methods. 
You can check the [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html) to see the class APIs and see it s capability

More formally, it is a rank-$2$ array, with axes labelled as _rows_ and _columns_.
It is the basic object in pandas and a really common way to load data in memory in order to operate on them.

Now the question you are all wondering: how to _create a dataframe_. There are several ways, by tuples, by lists, by numpy arrays or even by dictionaries. 
As a first instance, let's consider a list of names corresponding to people and their age, you can create a data frame in this way:

In [2]:
import pandas as pd # pd is a standard alias for pandas library.

In [ ]:

# List of lists made by [str, int]
lst = [['mario', 25], ['billy', 30], ['lakitu', 26], ['bowser', 22]]

df = pd.DataFrame(lst, columns=['Name', 'Age'])
df

In [ ]:
# Dict made by {str: int}
data_dict = {'mario': 25, 'billy': 30, 'lakitu': 26, 'bowser': 22}

df = pd.DataFrame(data=data_dict.items(), columns=['Name', 'Age'])
df

In [ ]:
# Read from csv file
df = pd.read_csv('datasets/people.csv', header=None, names=['Name', 'Age'])
df

In [ ]:
# Read from a numpy array
import numpy as np

arr = np.array([['mario', 25], ['billy', 30], ['lakitu', 26], ['bowser', 22]])
df = pd.DataFrame(arr, columns=['Name', 'Age'])
df

As you can see we have the exact same object.
Once data are organised in the dataframe, no matter how we imported them, they are stored in that object that has always the same methods and attributes.

### Series

A `Series` is a one-dimensional data structure. It can have any data structure like integer, float, and string, or even composite ones like lists, dictionaries, etc. 

It is useful when you want to perform computation or return a one-dimensional array.
A series, by definition, cannot have multiple columns.
For the latter case, use the data frame structure, which indeed can be considered as made up by series.

Series has one parameters, the data, that can be a list, a dictionary, or a scalar value:

In [ ]:
pd.Series([1., 2., 3.])

### Read from files

Data can be loaded in a DataFrame from different data format, like csv, xlx, json, etc.

The most common file type is the csv (comma separated values).
You can load them into a `Dataframe` using `read_csv` method, eventually specifying also the type of delimeter used for separating the values.

In [ ]:
df_travel = pd.read_csv('datasets/travel_blog_data.csv', delimiter=';')
df_travel

This dataset holds the user activity data from a travel blog. 

It is noteworthy a default behaviour in pandas `read_csv`.
The csv file do not have a header row, therefore pandas used the first row of data as header; in order to set the name of the columns you can use the `name` parameter.

In [ ]:
df_travel = pd.read_csv('datasets/travel_blog_data.csv', delimiter=';',
                 names=['timestamp', 'event', 'country', 'user_id', 'source', 'topic'],
                 parse_dates=True)
df_travel.shape

Sometimes, it might be handy not to print the whole dataframe and flood your screen with data. 
When a few lines is enough, you can print only the first $n$ lines – by typing:

```python
df_travel.head(n)
```

If you leave the $n$ parameter blank, the method takes the default value, that is $5$.

In [ ]:
df_travel.head(20)

By symmetry, you can imagine what the `tail` method returns.

In [ ]:
df_travel.tail()

We might also need a random sampling of $k$ lines out of the dataframe, this can be achieved by the `sample` method.

In [ ]:
df_travel.sample(7)

Other two dataframe methods that are very useful in analysing data are `describe` and `info`.

The `describe` method allows to get some statistical information about our data.

In [ ]:
print(type(df_travel.describe()))
df_travel.describe()

Note how the result is again a dataframe whose index is a list of statistical properties, and as columns the values of indexed properties for the first available numerical column (in our case `user_id`).

As one can read in the [docs](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.describe.html) the method returns a Summary statistics of the Series or Dataframe provided.

Again, from the official documentation 

> For numeric data, the result’s index will include `count`, `mean`, `std`, `min`, `max` as well as lower, $50$ and upper percentiles. By default the lower percentile is $25$ and the upper percentile is $75$. The $50$ percentile is the same as the median.
>
> For object data (e.g. strings or timestamps), the result’s index will include `count`, `unique`, `top`, and `freq`. The `top` is the most common value. The `freq` is the most common value’s frequency. `Timestamps` also include the first and last items.
>
> If multiple object values have the highest count, then the `count` and `top` results will be arbitrarily chosen from among those with the highest count.
>
> _For mixed data types provided via a DataFrame, the default is to return only an analysis of numeric columns. If the dataframe consists only of object and categorical data without any numeric columns, the default is to return an analysis of both the object and categorical columns. If include='all' is provided as an option, the result will include a union of attributes of each type._
>
> The include and exclude parameters can be used to limit which columns in a DataFrame are analyzed for the output. The parameters are ignored when analyzing a Series.

We can however try to override the default behaaviour and we can do so by setting `include='all'` parameter.

In [ ]:
df_travel.describe(include='all')

On the other hand, we also have `info` method.

In [ ]:
dataframe_info  = df_travel.info()
dataframe_info

This method actually returns a `NoneType`. But in the execution _prints_ on screen some information about the dataframe. 
It is less informative (almost not informative at all) from the statistics point of view, but it tells us some numerical property of the dataframe, indeed this method prints information about the DataFrame including the index `dtype` and columns, non-null values and memory usage.

Interesting enough the first colum however should be able to be parsed into an object more easy to read. 
In particular, since the column clearly represents a date we can transform it into an object that is more recognisibile.
We can parse it into `datetime` object.

In [ ]:
# Using the dadtaframe function to_datetime() to convert the timestamp column to datetime
# Saving the output directly to the timestamp column by replacing it
df_travel['timestamp'] = pd.to_datetime(df_travel['timestamp'])
df_travel.info()

# Extracting date and time from the first row
first_row_timestamp = df_travel.loc[0, 'timestamp']
extracted_date = first_row_timestamp.date()
extracted_time = first_row_timestamp.time()

print("Date from the first row:", extracted_date)
print("Time from the first row:", extracted_time)

The last descriptive method we present here is the `corr` one. 
By using such a method we can generate the relationship between each numerical variables.
This function will throw an error if you load a dataset that does not contain numerical values.

In [ ]:
df_memory = pd.read_csv('datasets/memory_recall_test.csv', delimiter=',')
df_memory.head()

correlation_matrix = df_memory.corr()
correlation_matrix

### Filter by selecting columns

Sometimes you will need to only work with specific columns from a dataset.
You can do so by using the two following and equivalent syntaxes.
The second syntax is less flexible as it required the column names to be in a certain way.

In [ ]:
# first way, the square bracket notation
age = df_memory['Age (Years)']
print(type(age))

In [ ]:
# second way, the point notation
# the column name must not contain spaces, special characters, or starts with a number
# if you want to use dot notation, you would need to rename the column to remove spaces and special characters.
# for example:
df_memory.rename(columns={'Age (Years)': 'Age_years'}, inplace=True)

# the inplace parameter is used to modify the dataframe in place, without creating a new dataframe object otherwise you would need to assign the output to a new variable
# new_df_memory = df_memory.rename(columns={'Age (Years)': 'Age_years'})
age = df_memory.Age_years
print(type(age))

<div class="alert alert-block alert-info">
⚠️ Both of the previous syntaxes return a <em>Series</em> rather than a <em>Dataframe</em>
</div>

If you want a dataframe, you need to slightly change the previous commands in

In [ ]:
# Hard way, no one uses that.
pd.DataFrame(df_memory.Age_years)

In [ ]:
# Easy way, it generalises easily to the multi-column case.
age = df_memory[['Age_years']]
print(type(age))

#### What about multi-column filter?

As the previous cell might suggest, you only need to pass a list of columns.

Note the double bracket `[[]]`, you can consider `[]` as a _filter_ operator, whose argument is the `list` of column names.
Recall that a `Series` admits only one column, hence the result of this operation cannot be other than a dataframe.

In [ ]:
# just reloading the data to make sure we have the original data
df_travel = pd.read_csv('datasets/travel_blog_data.csv', delimiter=';',
                 names=['timestamp', 'event', 'country', 'user_id', 'source', 'topic'],
                 parse_dates=True)

df_travel[['user_id','country']]

The order of names changes the order in the returned dataframe.

In [ ]:
df_travel[['country', 'user_id']]

### Filter rows on values

There is complementary way of filtering a dataframe, on rows value. Hence, we can reduce the number of records in the dataframe based on some condition.

Let's use the imnported travel dataframe, and for instance, you want to see the entries corresponding to the users who came from the "SEO" source. In this case you have to filter for the "SEO" value in the "source" column.

In [ ]:
df_travel[df_travel.source == 'SEO']

In order to better understand the command above, let's focus on how pandas interpret the filtering procedure.

**Step 1**: First, between the bracket frames `[]` it evaluates every line: is the `df.source` column’s value `'SEO'` or not? The results are boolean values (True or False), better a `Series` of boolean values. 
Indeed, we have seen how `df.source` is a series, a comparison with a value (through the binary operator `==`) will produce a truth-value object of the same type of `df.source` hence a series.

In [ ]:

# Note the dtype attribute
df_travel.source == 'SEO'

**step 2**: The previous boolean series is what is called a _mask_.
If we filter through a mask, the filtered dataframes returns every row where the mask is `True` and drops any row where it is `False`.
This is equivalent to the logical indexing in `Matlab`

In [ ]:
# A less concise, but maybe clearer notation
mask_seo = (df_travel.source == 'SEO') # Boolean series
print(type(mask_seo))
df_travel[mask_seo] # Masks away the rows corresponding to "False".

It is obvious now that you can combine more conditions to end up into a boolean mask and apply even complicated filter.

_Example_: We want to filter the dataframe to get all the users coming from a "SEO" source, with topic related to "Asia" and with a timestamp between 23.00 and 23.30.

In [ ]:
bool_mask = ((df_travel.source == 'SEO') & (df_travel.topic == 'Asia') & (df_travel.timestamp >= '2018-01-01 23:00:00') & (df_travel.timestamp <= '2018-01-01 23:30:00'))
df_travel[bool_mask]

### Creating new columns

Creating a new column is easy, you simply _declare_ the new column name as `df["new_col"] =  new_col` where `new_col` is a pandas Series.
The new column will be filled with `NaN`` (Not a Number, which is Pandas' standard missing data marker) for all rows where the Series does not have a corresponding index.

You can also calculate the new column entries by operating on existing ones.

In [ ]:
# Create a new column as the string concatenation of "country" and "topic"
df_travel["contry_code_per_continent"] = df_travel.country + "||" + df_travel.topic
df_travel

In [ ]:
# Create a further column made by the 2nd letter of the string contained in the "event" column
df_travel["part_string"] = df_travel.event.str[1]
df_travel

### Sequential filtering and masks 

Filter and mask operations can be used sequentially, one after the other.

It is very important to understand that pandas’s logic is linear. 
So if you apply a function, you can always apply another one on the result. 
In this case, the input of the latter function will always be the output of the previous one. 
This will have a very nice consequence in a construct called `pipe` (see later for details).

As you have already seen, for instance, we can combine two selection methods.

In [ ]:
# executed head() first then apply the column selection
df_travel.head()[['country', 'user_id']]

This line first selects the first $5$ rows of our dataframe. And then it takes only the ‘country’ and the ‘user_id’ columns.

As these operations are commutative, you would not be surprised by the fact that one can get the same result with the reversed chain of functions.

In [ ]:
df_travel[['country', 'user_id']].head()

In this version, you select the columns first, then take the first five rows. 
The result is the same – just the order of the functions (and the execution) is different.

_Try to think which one is better in terms of computational time._

We can check it by running some very simple test using the Python in-built package time

In [ ]:
import time

# This dataset is quite large so it s not part of the files you can download from the course page.

df_large_dataset = pd.read_csv('./datasets/large_dataset.csv', delimiter=',')
print(df_large_dataset.shape)

In [ ]:
# Initialize total time counters
total_time_first_method = 0
total_time_second_method = 0

iterations = 1000

for _ in range (iterations):
    # Measure time for df_travel[['country', 'user_id']].head()
    start_time = time.time()
    df_large_dataset[['country', 'user_id']].head(100)
    end_time = time.time()
    total_time_first_method += end_time - start_time

    # Measure time for df_travel.head()[['country', 'user_id']]
    start_time = time.time()
    df_large_dataset.head()[['country', 'user_id']]
    end_time = time.time()
    total_time_second_method += end_time - start_time

# Compute average time for each method
time_first_method = total_time_first_method / iterations
time_second_method = total_time_second_method / iterations

print(f"Time for first method: {time_first_method:6f} seconds")
print(f"Time for second method: {time_second_method:6f} seconds")

There a lot of interesting ways of selecting columns out of a dataframe. 
Look at this [nice post](https://towardsdatascience.com/interesting-ways-to-select-pandas-dataframe-columns-b29b82bbfb33#:~:text=Selecting%20columns%20based%20on%20their,Returns%20a%20pandas%20series.&text=Passing%20a%20list%20in%20the,columns%20at%20the%20same%20time.) in order to look at some non-standard examples.

### Aggregations

In Python, particularly in the context of data analysis with libraries like Pandas, "aggregation" refers to the process of combining multiple data points into a single value based on a specified criterion or operation.
This process is crucial in data analysis for summarizing data, extracting insights, and simplifying complex datasets.

Let's consider a new dataset.

In [26]:
zoo = pd.read_csv("datasets/zoo.csv")
zoo

      animal  uniq_id  water_need
0   elephant     1001         500
1   elephant     1002         600
2   elephant     1003         550
3      tiger     1004         300
4      tiger     1005         320
5      tiger     1006         330
6      tiger     1007         290
7      tiger     1008         310
8      zebra     1009         200
9      zebra     1010         220
10     zebra     1011         240
11     zebra     1012         230
12     zebra     1013         220
13     zebra     1014         100
14     zebra     1015          80
15      lion     1016         420
16      lion     1017         600
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

Counting the number of the animals is as easy as applying a `count` function on the zoo dataframe.

In [ ]:
zoo.count()

As one can observe, the `count()` method counts the number of values in each column. 
In the case of the zoo dataset, there were $3$ columns, and each of them had $22$ values in it.

If you want to make your output clearer, you can select the animal column first by using one of the selection operators from the previous section.

In [ ]:
zoo[['animal']].count()

Or in this particular case, the result could be even nicer for Series, in fact to show just the number and not the column name nor the type, one can use the following syntax.

In [ ]:
zoo.animal.count()

Here, as before, one can notice how pandas applied functions sequentially. 
First, `zoo.animal` is a Series, then calculated the count of it. 

Indeed an equivalent, even if less compact notation, for this is the following.

In [ ]:
animal_series = zoo.animal
animal_series.count()

Following the same logic, one can sum all the values inside a column by the `sum` method.

In [ ]:
zoo.water_need.sum()

You can see there are a lot of methods and one should know in advance what they are and how they works.

In order to get such information, the royal road is to read the documentation. However, a convenient way to get a list of all available methods of a class instance is the function `dir`.

In [ ]:
dir(zoo)

By looking at the class function declarations you can start asking questions to your data.

_e.g_ What is the smallest amount of `water_need` for the zoo?

In [ ]:
zoo.water_need.min()

Similarly, one can find the highest value.

In [ ]:
zoo.water_need.max()

And eventually, let’s calculate statistical averages, like mean and median.

In [ ]:
print(f"Mean {zoo.water_need.mean()} and median {zoo.water_need.median()}")

### Grouping
Sometimes you will need to do segmentations on your data.
Think about of an experiment where you want to compare different output metrics based on different experimental conditions.
 
For instance, it is nice to know the mean `water_need` of all animals (we have just learned that it is $347.72$).
But very often it is much more actionable to break this number down – let’s say – by animal types. 
With that, we can compare the species to each other – or we can find outliers.

Here is a simplified visual that shows how pandas performs “_segmentation_” (grouping and aggregation) based on the column values.

<p align="center">
    <img width="735" src="https://github.com/Lenakeiz/ICN_Programming_Course/blob/main/Images/grouping_concepts.png?raw=true">
</p>

Let’s apply grouping on our zoo DataFrame. 

Speaking of code, we only have to fit in a `groupby` keyword between our zoo variable and our `mean()` command.

In [ ]:
zoo.groupby('animal').mean()

This is a very important operation. We aggregated by animal unique values (used as indices in the resulting dataframe) and calculated the mean.
Here the mean has the role of _aggregation function_.
One can use other aggregation functions to get different results.

_e.g._ median, count, list, etc.

For example we could try to implement a custom metric that we want to apply after the aggregation function that takes only the 3rd entry from each given animal. 

<div class="alert alert-block alert-info">
ℹ️ you can use the <em>lambda</em> notation to write functions on a line.
</div>

In [ ]:
# Define a lambda function to extract the third entry of each animal
# We'll group by 'animal' and then apply the function to get the third entry
third_entry = lambda x: x.iloc[2] if len(x) > 2 else None

# Apply the aggregation function to the grouped DataFrame
third_entry_df = zoo.groupby('animal').apply(third_entry, include_groups=False)
third_entry_df

Finally, note how `groupby` on its own does not aggregate anything.

In [ ]:
df_zoo_group_by = zoo.groupby("animal")
print(type(df_zoo_group_by))
df_zoo_group_by

The type of the returned object is a `DataFrameGroupBy`.
It does not have practical uses, apart from the fact that can be iterated to get a dataframe for each group.

This can be very useful if you are planning to do additional analysis on each of the grouped dataframes.

In [27]:
for key, df in zoo.groupby("animal"):
    print(f"This is the key, e.g. the selected animal: {key}")
    print(f"This is the df, e.g. the grouped df by animal: \n {df}")
    print("="*20)
    print("\n")

This is the key, e.g. the selected animal: elephant
This is the df, e.g. the grouped df by animal:
      animal  uniq_id  water_need
0  elephant     1001         500
1  elephant     1002         600
2  elephant     1003         550
====================


This is the key, e.g. the selected animal: kangaroo
This is the df, e.g. the grouped df by animal:
       animal  uniq_id  water_need
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410
====================


This is the key, e.g. the selected animal: lion
This is the df, e.g. the grouped df by animal:
    animal  uniq_id  water_need
15   lion     1016         420
16   lion     1017         600
17   lion     1018         500
18   lion     1019         390
====================


This is the key, e.g. the selected animal: tiger
This is the df, e.g. the grouped df by animal:
   animal  uniq_id  water_need
3  tiger     1004         300
4  tiger     1005         320
5  tiger     1006         330
6  tiger     1007         290
7  tiger     1008         310
====================


This is the key, e.g. the selected animal: zebra
This is the df, e.g. the grouped df by animal:
    animal  uniq_id  water_need
8   zebra     1009         200
9   zebra     1010         220
10  zebra     1011         240
11  zebra     1012         230
12  zebra     1013         220
13  zebra     1014         100
14  zebra     1015          80
====================

### Merge
In our experiments, we usually do not store all the data in one big data table.

We store it in a few smaller ones instead, usually each data table consisting on the data for each single participant.

Apart from the practicality of doing so, there are many reasons behind this; for instance, by using multiple data tables, it is easier to manage your data, easier to avoid redundancy, you can save some disk space, you can query the smaller tables faster, etc.

The point is that it is quite usual that during your analysis you have to pull your data from two or more different tables.
The solution for that is called _merge_ (in computer programmming this is very similar to use `structured query language (SQL)` on databases).

Let’s take our zoo dataframe in which we have all our animals, and let’s say that we have another dataframe, `zoo_eats`, that contains information about the food requirements for each species.

In [28]:
# Import dataframe and print it to get a first glance
zoo_eats = pd.read_csv("datasets/zoo_eats.csv")
zoo_eats

     animal        food
0  elephant  vegetables
1     tiger        meat
2  kangaroo  vegetables
3     zebra        meat
4   giraffe  vegetables

As you can see we have the animal column, containing the name of the species and the kind of food they eat.

We want to merge these two tables into one in order to get all the information in the same place.

We can use several way to do that (the most basic one, _strongly_ discouraged is a `for` loop over animal column of `zoo` dataframe). 
One of the most efficient ones is to use the `merge` method of pandas.

In [29]:
zoo.merge(zoo_eats, on="animal") # Here the `on` parameter is not strictly necessary as it is the only column the two df's have in common.

      animal  uniq_id  water_need        food
0   elephant     1001         500  vegetables
1   elephant     1002         600  vegetables
2   elephant     1003         550  vegetables
3      tiger     1004         300        meat
4      tiger     1005         320        meat
5      tiger     1006         330        meat
6      tiger     1007         290        meat
7      tiger     1008         310        meat
8      zebra     1009         200        meat
9      zebra     1010         220        meat
10     zebra     1011         240        meat
11     zebra     1012         230        meat
12     zebra     1013         220        meat
13     zebra     1014         100        meat
14     zebra     1015          80        meat
15  kangaroo     1020         410  vegetables
16  kangaroo     1021         430  vegetables
17  kangaroo     1022         410  vegetables

For those familiar with SQL, this is equivalent to an _inner join_ where left table is `zoo` and right `zoo_eats`.
We could have done the opposite just by exchanging the two dataframes.

```python
zoo_eats.merge(zoo, on="animal")
```

This would have just changed the order of columns.

**Obervation**: Can you see there is no lion 🦁, nor giraffe 🦒? Can you tell why?

The followings are the type of joins that you can operate similar to SQL.

<p align="center">
    <img width="600" src="https://github.com/Lenakeiz/ICN_Programming_Course/blob/main/Images/joins-sql.png?raw=true">
</p>

When you do an `INNER JOIN` (that is the default in pandas), you merge only those values that are found in both tables. 
On the other hand, when you do the `OUTER (FULL) JOIN`, it merges all values, even if you can find some of them in only one of the tables.

Let’s see a concrete example: did you realize that there is no lion value in zoo_eats? Or that we don’t have any giraffes in zoo? When we did the merge above, by default, it was an INNER merge, so it filtered out giraffes and lions from the result table. But there are cases in which we do want to see these values in our joined dataframe.

In [30]:
zoo.merge(zoo_eats, how='outer')

      animal  uniq_id  water_need        food
0   elephant   1001.0       500.0  vegetables
1   elephant   1002.0       600.0  vegetables
2   elephant   1003.0       550.0  vegetables
3    giraffe      NaN         NaN  vegetables
4   kangaroo   1020.0       410.0  vegetables
5   kangaroo   1021.0       430.0  vegetables
6   kangaroo   1022.0       410.0  vegetables
7       lion   1016.0       420.0         NaN
8       lion   1017.0       600.0         NaN
9       lion   1018.0       500.0         NaN
10      lion   1019.0       390.0         NaN
11     tiger   1004.0       300.0        meat
12     tiger   1005.0       320.0        meat
13     tiger   1006.0       330.0        meat
14     tiger   1007.0       290.0        meat
15     tiger   1008.0       310.0        meat
16     zebra   1009.0       200.0        meat
17     zebra   1010.0       220.0        meat
18     zebra   1011.0       240.0        meat
19     zebra   1012.0       230.0        meat
20     zebra   1013.0       220.0        meat
21     zebra   1014.0       100.0        meat
22     zebra   1015.0        80.0        meat

Lions came back 🦁, the giraffe came back 🦒.

The only thing is that we have empty (`NaN`) values in those columns where we did not get information from the other table.

Let's do some further observation.
In this specific case, it might make more sense to keep lions in the table but not the giraffes.
Since there are no giraffe in our zoo.
In addition, with this choice, we could see all the animals in our zoo and we would have three food categories: vegetables, meat and NaN (which is basically “no information”). 

In order to do so, we would need to say to the merge method we only want to show animals from `zoo` dataframes, not the `zoo_eats` ones. That is precisely what merging with a `how = 'left'` parameter does.

In [31]:
zoo.merge(zoo_eats, how="left", on="animal")

      animal  uniq_id  water_need        food
0   elephant     1001         500  vegetables
1   elephant     1002         600  vegetables
2   elephant     1003         550  vegetables
3      tiger     1004         300        meat
4      tiger     1005         320        meat
5      tiger     1006         330        meat
6      tiger     1007         290        meat
7      tiger     1008         310        meat
8      zebra     1009         200        meat
9      zebra     1010         220        meat
10     zebra     1011         240        meat
11     zebra     1012         230        meat
12     zebra     1013         220        meat
13     zebra     1014         100        meat
14     zebra     1015          80        meat
15      lion     1016         420         NaN
16      lion     1017         600         NaN
17      lion     1018         500         NaN
18      lion     1019         390         NaN
19  kangaroo     1020         410  vegetables
20  kangaroo     1021         430  vegetables
21  kangaroo     1022         410  vegetables

No more giraffe 🦒!

The `how = 'left'` parameter brought all the values from the left table (`zoo`) but brought only those values from the right table (`zoo_eats`) that we have in the left one, too.

For doing the merge, pandas needs the key-columns you want to base the merge on (in our case it was the `animal` column in both tables). If you are not so lucky that pandas automatically recognizes these key-columns, or if they have different names you have to help it by providing the column names. That is what the `on`, `left_on` and `right_on` parameters are for.

### Sorting
Sorting is essential. The basic sorting method is not too difficult in pandas. 
The function is called `sort_values`.

In [32]:
zoo.sort_values('water_need')

      animal  uniq_id  water_need
14     zebra     1015          80
13     zebra     1014         100
8      zebra     1009         200
9      zebra     1010         220
12     zebra     1013         220
11     zebra     1012         230
10     zebra     1011         240
6      tiger     1007         290
3      tiger     1004         300
7      tiger     1008         310
4      tiger     1005         320
5      tiger     1006         330
18      lion     1019         390
19  kangaroo     1020         410
21  kangaroo     1022         410
15      lion     1016         420
20  kangaroo     1021         430
17      lion     1018         500
0   elephant     1001         500
2   elephant     1003         550
1   elephant     1002         600
16      lion     1017         600

For the opposite sorting order it is sufficient to set the boolean parameter `ascending` to `False`.

In [ ]:
zoo.sort_values('water_need', ascending=False)

Quite often, you have to sort by multiple columns, so in general, it is recommended using the by keyword for the columns.
The list of keys order sets the order of priority in the sorting.

In [33]:
zoo.sort_values(by=['animal', 'water_need'])

      animal  uniq_id  water_need
0   elephant     1001         500
2   elephant     1003         550
1   elephant     1002         600
19  kangaroo     1020         410
21  kangaroo     1022         410
20  kangaroo     1021         430
18      lion     1019         390
15      lion     1016         420
17      lion     1018         500
16      lion     1017         600
6      tiger     1007         290
3      tiger     1004         300
7      tiger     1008         310
4      tiger     1005         320
5      tiger     1006         330
14     zebra     1015          80
13     zebra     1014         100
8      zebra     1009         200
9      zebra     1010         220
12     zebra     1013         220
11     zebra     1012         230
10     zebra     1011         240

### Indexing

You may have noticed pandas dataframes have an index structure. This can be retrieved by the attribute `index`

In [35]:
zoo.index

RangeIndex(start=0, stop=22, step=1)

You can use the python indexing notation on the `df.loc` and `df.iloc` objects to retrieve entries. 
Note, `loc` stands for location, while `iloc` stands for _index location_.

The main distinction between `loc` and `iloc` is:

* `loc` is label-based, which means that you have to specify rows and columns based on their row and column _labels_.
* `iloc` is integer position-based, so you have to specify rows and columns by their _integer position values_ (0-based integer position).

We report here a table to collect differences and similarities.
<p align="center">
    <img width="1000" src="https://miro.medium.com/max/1400/1*CgAWzayEQY8PQuMpRkSGfQ.png">
</p>

In [ ]:
zoo.iloc[3]

In [ ]:
zoo.iloc[lambda x: x.index % 2 == 0]

#### Selecting via a single value
Both loc and iloc allow input to be a single value. We can use the following syntax for data selection:
* `loc[row_label, column_label]`
* `iloc[row_position, column_position]`

When index is numeric, like in our `zoo` example `loc` and `iloc` on rows behaves in the same way.
Let's consider the groupby results.

For example, let’s say we would like to retrieve the 'tiger' water need mean value.
With loc, we can pass the row label 'tiger' and the column label 'water_need'.

In [36]:
grouped_zoo = zoo.groupby("animal").mean()
grouped_zoo

          uniq_id  water_need
animal
elephant   1002.0  550.000000
kangaroo   1021.0  416.666667
lion       1017.5  477.500000
tiger      1006.0  310.000000
zebra      1012.0  184.285714

In [37]:
grouped_zoo.loc["tiger", 'water_need']

np.float64(310.0)

The equivalent `iloc` statement should take the row number `3` and the column number `1`.

In [38]:
grouped_zoo.iloc[3,1]

np.float64(310.0)

There is plenty of other selection choices, hence we refer to [this nice post](https://towardsdatascience.com/how-to-use-loc-and-iloc-for-selecting-data-in-pandas-bd09cb4c3d79) to summarise a further couple of them.


#### Reset_index

Now that we are aware of the indexing structure of dataframes, one may feel in need to reset index order, _e.g._ you may have noticed that after a sorting operation it can happen that all the indexes become shuffled.

Wrong indexing can mess up your visualizations sometimes.

The point is: in certain cases, when you have done a transformation on your dataframe, you have to re-index the rows. For that, you can use the `reset_index()` method.

In [39]:
zoo.sort_values(by=['water_need'], ascending=False).reset_index()

    index    animal  uniq_id  water_need
0       1  elephant     1002         600
1      16      lion     1017         600
2       2  elephant     1003         550
3       0  elephant     1001         500
4      17      lion     1018         500
5      20  kangaroo     1021         430
6      15      lion     1016         420
7      19  kangaroo     1020         410
8      21  kangaroo     1022         410
9      18      lion     1019         390
10      5     tiger     1006         330
11      4     tiger     1005         320
12      7     tiger     1008         310
13      3     tiger     1004         300
14      6     tiger     1007         290
15     10     zebra     1011         240
16     11     zebra     1012         230
17     12     zebra     1013         220
18      9     zebra     1010         220
19      8     zebra     1009         200
20     13     zebra     1014         100
21     14     zebra     1015          80

As you can see, our new dataframe kept the old indexes, too. 
If you want to remove them, just add the `drop = True` parameter.

In [40]:
zoo.sort_values(by=['water_need'], ascending=False).reset_index(drop=True)

      animal  uniq_id  water_need
0   elephant     1002         600
1       lion     1017         600
2   elephant     1003         550
3   elephant     1001         500
4       lion     1018         500
5   kangaroo     1021         430
6       lion     1016         420
7   kangaroo     1020         410
8   kangaroo     1022         410
9       lion     1019         390
10     tiger     1006         330
11     tiger     1005         320
12     tiger     1008         310
13     tiger     1004         300
14     tiger     1007         290
15     zebra     1011         240
16     zebra     1012         230
17     zebra     1013         220
18     zebra     1010         220
19     zebra     1009         200
20     zebra     1014         100
21     zebra     1015          80

### Fillna

Let’s rerun the left-merge method that we have used above. The `NaN` values appearing in lions rows may be something that we want to discard.

In [ ]:
zoo.merge(zoo_eats, how='left')

The problem is that we have NaN values for lions.
`NaN` usually is a problem when we do our data analysis, so one can choose to replace those values with something more meaningful.
Usually to get unbiased results, we substitute the NaN with the mean for that variable.
In some other case we could put a default value, this can be a $0$ value, or in other cases a specific string value. 

In this case even if the `zoo_eat` dataframe gave us no clue about the lion, we will put our best guess.

<div class="alert alert-block alert-info">
⚠️ Of course you never add best guesses to your real data, unless you are 100% you are not biasing your results
</div>

Let’s use the `fillna` method, which basically finds and replaces all `NaN` values in our dataframe.

In [ ]:
zoo.merge(zoo_eats, how='left').fillna('meat')

---

## A data analysis

Furthermore we are going to use pandas tools to perform an _exploratory data analysis_ over a dataset.

### Import data

An interesting feature of read methods in pandas are that it is allowed to give them a url and they will read data from it.

#### The dataset

We are going to use a famous dataset, the notorious [IMBD movies dataset]().
The IMDB movie reviews dataset is a set of reviews, there are various versions of it, one can read more about the version used in these lectures in the [official documentation](https://files.grouplens.org/datasets/movielens/ml-latest-README.html). 
The dataset is available online and can be either directly downloaded from Stanford’s website.

In [41]:
# Import data 
df_movies = pd.read_csv("https://raw.githubusercontent.com/LearnDataSci/articles/master/Python%20Pandas%20Tutorial%20A%20Complete%20Introduction%20for%20Beginners/IMDB-Movie-Data.csv", index_col="Title")
df_movies

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0
...,...,...,...,...,...,...,...,...,...,...,...
Secret in Their Eyes,996,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,NaN,45.0
Hostel: Part II,997,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46.0
Step Up 2: The Streets,998,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
Search Party,999,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
Nine Lives,1000,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

One can check the dimensions by a method inherited by numpy.

In [43]:
df_movies.shape

(1000, 11)

Sometime you might have data with duplicated rows (for example if you are writing to your saving file at higher frequency to which you query experimental variables (e.g. keyboard)). In that case you might need to use the `drop_duplicates` method to clear duplicated rows. The function works by checking the content of each row with subsequent one and find a match only when all columns are identical. You will also return a copy of your `DataFrame`.

Another important argument for `drop_duplicates` is `keep`, which has three possible options:

1. `"first"`: (default) Drop duplicates except for the first occurrence.
2. `"last"`: Drop duplicates except for the last occurrence.
3. `False`: Drop all duplicates.

Since we did not indicate the keep argument in the previous example it was defaulted to `"first"`. This means that if two rows are the same pandas will drop the second row and keep the first one. 
Using `last` has the opposite effect: the first row is dropped.

`keep = False`, on the other hand, will drop all duplicates. If two rows are the same then both will be dropped. 
Let's see what happens to `temp_df`.

In [47]:
temp_df = pd.concat([df_movies,df_movies])  # duplicate the entire dataset and append it 
temp_df.drop_duplicates(inplace=True, keep=False)
temp_df.shape

(0, 11)

Since all rows were duplicates, `keep=False` dropped them all resulting in zero rows being left over.

### Column clean up

Sometimes you will work on other people collected datasets, these datasets might contain verbose column names with symbols, upper and lowercase words, spaces, and typos.
Unless you have a clear instruction of the experiment, how the dataset was collected and what were the exact name of the variables it makes sense to spend a little time cleaning up column names.
Also for how pandas wok with indexing it may be beneficial to change some of the column names.

Here is how to print the column names of our dataset.

In [ ]:
df_movies.columns

Not only does `columns` come in handy if you want to rename columns by allowing for simple copy and paste, it is also useful if you need to understand why you are receiving a Key Error when selecting data by column.

We can use the `rename` method to rename certain or all columns via a dict. We do not want parentheses, so let's rename those.

In [53]:
df_movies = df_movies.rename(columns={
    'Runtime (Minutes)': 'Runtime',
    'Revenue (Millions)': 'Revenue_millions'
})
df_movies.columns

Index(['Rank', 'Genre', 'Description', 'Director', 'Actors', 'Year', 'Runtime',
       'Rating', 'Votes', 'Revenue_millions', 'Metascore'],
      dtype='object')

Excellent. But what if we want to lowercase all names? 
Instead of using `rename` we could also reassing the column attribute to a list of names like so.

In [55]:
df_movies.columns = [col.lower() for col in df_movies]
df_movies.columns

Index(['rank', 'genre', 'description', 'director', 'actors', 'year', 'runtime',
       'rating', 'votes', 'revenue_millions', 'metascore'],
      dtype='object')

#### Missing values

When exploring data, one most likely encounters missing or null values, which are essentially placeholders for non-existent values. 
Most commonly in these contexts one faces Python's `None` or NumPy's `np.nan`, each of which have to be handled differently according to situations.

There are two options in dealing with nulls:

1. Get rid of rows or columns with nulls
2. Replace nulls with non-null values

Let's calculate to total number of nulls in each column of our dataset. The first step is to check which cells in our DataFrame are null.

In [48]:
df_movies.isnull()

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Guardians of the Galaxy,False,False,False,False,False,False,False,False,False,False,False
Prometheus,False,False,False,False,False,False,False,False,False,False,False
Split,False,False,False,False,False,False,False,False,False,False,False
Sing,False,False,False,False,False,False,False,False,False,False,False
Suicide Squad,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
Secret in Their Eyes,False,False,False,False,False,False,False,False,False,True,False
Hostel: Part II,False,False,False,False,False,False,False,False,False,False,False
Step Up 2: The Streets,False,False,False,False,False,False,False,False,False,False,False
Search Party,False,False,False,False,False,False,False,False,False,True,False
Nine Lives,False,False,False,False,False,False,False,False,False,False,False

Notice `isnull` returns a DataFrame where each cell is either `True` or `False` depending on that cell's null status.

To count the number of nulls we can use the function any that returns a `Series` of True/False if any of the elements in a single row is True after teh `isnull` function

In [49]:
num_null_rows = df_movies.isnull().any(axis=1).sum()
print("Number of rows with at least one null value:", num_null_rows)

Number of rows with at least one null value: 162

Removing nulls is pretty simple.

In [50]:
df_movies.dropna() # This drops the whole line where a NaN appears.

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0
...,...,...,...,...,...,...,...,...,...,...,...
Resident Evil: Afterlife,994,"Action,Adventure,Horror",While still out to destroy the evil Umbrella C...,Paul W.S. Anderson,"Milla Jovovich, Ali Larter, Wentworth Miller,K...",2010,97,5.9,140900,60.13,37.0
Project X,995,Comedy,3 high school seniors throw a birthday party t...,Nima Nourizadeh,"Thomas Mann, Oliver Cooper, Jonathan Daniel Br...",2012,88,6.7,164088,54.72,48.0
Hostel: Part II,997,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46.0
Step Up 2: The Streets,998,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
Nine Lives,1000,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

This operation will delete any row with at least a single null value, but it will return a new DataFrame without altering the original one.

Other than just dropping rows, you can also drop columns with null values by setting `axis=1`.

In [51]:
df_movies.dropna(axis=1)

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes
Title,,,,,,,,,
Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606
Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545
Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727
...,...,...,...,...,...,...,...,...,...
Secret in Their Eyes,996,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585
Hostel: Part II,997,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152
Step Up 2: The Streets,998,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699
Search Party,999,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881
Nine Lives,1000,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435

In our dataset, this operation would drop the `revenue_millions` and `metascore` columns.

##### Imputing
Imputation is referred to keeping valuable data replacing the null values.

There may be instances where dropping every row with a null value removes too big a chunk from your dataset, so instead we can impute that null with another value, usually the mean or the median of that column.

Let's look at imputing the missing values in the `revenue_millions` column. First we will extract that column series into its own variable.

In [56]:
revenues = df_movies['revenue_millions']
revenues.sample(15)

Title
Little Miss Sunshine                      59.89
The Ugly Truth                            88.92
A Good Year                                7.46
The Legend of Tarzan                     126.59
Taare Zameen Par                           1.20
The Escort                                  NaN
Nymphomaniac: Vol. I                       0.79
Ice Age: Collision Course                 64.06
The Three Musketeers                      20.32
Blood Diamond                             57.37
Tron                                     172.05
Notorious                                 36.84
The Mummy: Tomb of the Dragon Emperor    102.18
Hellboy II: The Golden Army               75.75
Suite Française                             NaN
Name: revenue_millions, dtype: float64

Slightly different formatting than a DataFrame, but we still have our Title index.

We will impute the missing values of revenue using the mean.

__Quick Exercise__: Find the mean of the series.

In [57]:
revenues_mean = revenues.mean()
print("Mean revenue:", revenues_mean)

Mean revenue: 82.95637614678898

The idea is to replace NaN values with the mean.

In [ ]:
revenues = revenues.fillna(revenues_mean)
df_movies['revenue_millions'] = revenues
df_movies['revenue_millions'].isnull().any().sum()

---

### Applying functions

Operating on the datasets means that sometimes we will also be required to do more complicated operations on our dataframes entries is ubiquitous. 
The iteration over a DataFrame or Series as you would with a list is possible, however, because of the complex structure of a dataframe, this is really not efficient.

An efficient alternative is to `apply` a function to the dataset.
For example, we could use a function to convert movies with an 8.0 or greater to a string value of `"good"` and the rest to `"bad"` and use this transformed values to create a new column.

First we would create a function that, when given a rating, determines if it's good or bad.

In [58]:
def rating_function(x, value):
    if x >= value:
        return "good"
    else:
        return "bad"

Now we want to send the entire rating column through this function, which is what `apply` does.
This operation is _vectorised_ so taking advantage of the pandas structures, it is more efficient than an explicit for loop.

In [59]:
df_movies["rating_category"] = df_movies["rating"].apply(rating_function, value = 8.0)
df_movies.sample(15)

,rank,genre,description,director,actors,year,runtime,rating,votes,revenue_millions,metascore,rating_category
Title,,,,,,,,,,,,
Dark Places,977,"Drama,Mystery,Thriller",Libby Day was only eight years old when her fa...,Gilles Paquet-Brenner,"Charlize Theron, Nicholas Hoult, Christina Hen...",2015,113,6.2,31634,NaN,39.0,bad
London Has Fallen,425,"Action,Crime,Drama","In London for the Prime Minister's funeral, Mi...",Babak Najafi,"Gerard Butler, Aaron Eckhart, Morgan Freeman,A...",2016,99,5.9,100702,62.40,28.0,bad
Underworld Awakening,622,"Action,Fantasy,Horror",When human forces discover the existence of th...,Måns Mårlind,"Kate Beckinsale, Michael Ealy, India Eisley, S...",2012,88,6.4,127157,62.32,39.0,bad
It Follows,223,"Horror,Mystery",A young woman is followed by an unknown supern...,David Robert Mitchell,"Maika Monroe, Keir Gilchrist, Olivia Luccardi,...",2014,100,6.9,136399,14.67,83.0,bad
Friend Request,532,"Horror,Thriller",When a college student unfriends a mysterious ...,Simon Verhoeven,"Alycia Debnam-Carey, William Moseley, Connor P...",2016,92,5.4,12758,64.03,59.0,bad
Legion,957,"Action,Fantasy,Horror",When a group of strangers at a dusty roadside ...,Scott Stewart,"Paul Bettany, Dennis Quaid, Charles S. Dutton,...",2010,100,5.2,84158,40.17,32.0,bad
Lucky Number Slevin,960,"Crime,Drama,Mystery",A case of mistaken identity lands Slevin into ...,Paul McGuigan,"Josh Hartnett, Ben Kingsley, Morgan Freeman, L...",2006,110,7.8,271940,22.49,53.0,bad
Florence Foster Jenkins,375,"Biography,Comedy,Drama","The story of Florence Foster Jenkins, a New Yo...",Stephen Frears,"Meryl Streep, Hugh Grant, Simon Helberg, Rebec...",2016,111,6.9,31776,27.37,71.0,bad
The Neighbor,706,"Crime,Horror,Thriller","Set in Cutter Mississippi, the film follows a ...",Marcus Dunstan,"Josh Stewart, Bill Engvall, Alex Essoe, Ronnie...",2016,87,5.8,4754,NaN,60.0,bad
Don't Fuck in the Woods,43,Horror,A group of friends are going on a camping trip...,Shawn Burkett,"Brittany Blanton, Ayse Howard, Roman Jossart,N...",2016,73,2.7,496,NaN,NaN,bad
Collide,376,"Action,Crime,Thriller",An American backpacker gets involved with a ri...,Eran Creevy,"Nicholas Hoult, Felicity Jones, Anthony Hopkin...",2016,99,5.7,7583,2.20,33.0,bad
A Million Ways to Die in the West,746,"Comedy,Romance,Western",As a cowardly farmer begins to fall for the my...,Seth MacFarlane,"Seth MacFarlane, Charlize Theron, Liam Neeson,...",2014,116,6.1,144779,42.62,44.0,bad
Moon,599,"Drama,Mystery,Sci-Fi",Astronaut Sam Bell has a quintessentially pers...,Duncan Jones,"Sam Rockwell, Kevin Spacey, Dominique McElligo...",2009,97,7.9,277123,5.01,67.0,bad
Colonia,555,"Drama,Romance,Thriller",A young woman's desperate search for her abduc...,Florian Gallenberger,"Emma Watson, Daniel Brühl, Michael Nyqvist,Ric...",2015,106,7.1,30074,NaN,33.0,bad
This Means War,754,"Action,Comedy,Romance",Two top CIA operatives wage an epic battle aga...,McG,"Reese Witherspoon, Chris Pine, Tom Hardy, Til ...",2012,103,6.3,154400,54.76,31.0,bad

The `apply` method passes every value in the rating column through the `rating_function` and then returns a new Series.
This Series is then assigned to a new column called `rating_category`.

You can also use anonymous functions as well. This `lambda` function achieves the same result as `rating_function`.

In [60]:
my_lambada = lambda x: 'good' if x >= 8.0 else 'bad'

df_movies["rating_category"] = df_movies["rating"].apply(
    my_lambada)
df_movies.sample(20)

,rank,genre,description,director,actors,year,runtime,rating,votes,revenue_millions,metascore,rating_category
Title,,,,,,,,,,,,
This Beautiful Fantastic,733,"Comedy,Drama,Fantasy",A young woman who dreams of being a children's...,Simon Aboud,"Jessica Brown Findlay, Andrew Scott, Jeremy Ir...",2016,100,6.9,688,NaN,51.0,bad
Eastern Promises,659,"Crime,Drama,Mystery",A Russian teenager living in London who dies d...,David Cronenberg,"Naomi Watts, Viggo Mortensen, Armin Mueller-St...",2007,100,7.7,198006,17.11,82.0,bad
Nine Lives,1000,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0,bad
John Carter,390,"Action,Adventure,Sci-Fi","Transported to Barsoom, a Civil War vet discov...",Andrew Stanton,"Taylor Kitsch, Lynn Collins, Willem Dafoe,Sama...",2012,132,6.6,220667,73.06,51.0,bad
Your Highness,986,"Adventure,Comedy,Fantasy","When Prince Fabious's bride is kidnapped, he g...",David Gordon Green,"Danny McBride, Natalie Portman, James Franco, ...",2011,102,5.6,87904,21.56,31.0,bad
Lucky Number Slevin,960,"Crime,Drama,Mystery",A case of mistaken identity lands Slevin into ...,Paul McGuigan,"Josh Hartnett, Ben Kingsley, Morgan Freeman, L...",2006,110,7.8,271940,22.49,53.0,bad
Mindhorn,8,Comedy,A has-been actor best known for playing the ti...,Sean Foley,"Essie Davis, Andrea Riseborough, Julian Barrat...",2016,89,6.4,2490,NaN,71.0,bad
The Girl with the Dragon Tattoo,224,"Crime,Drama,Mystery",Journalist Mikael Blomkvist is aided in his se...,David Fincher,"Daniel Craig, Rooney Mara, Christopher Plummer...",2011,158,7.8,348551,102.52,71.0,bad
Insidious,653,"Horror,Mystery,Thriller",A family looks to prevent evil spirits from tr...,James Wan,"Patrick Wilson, Rose Byrne, Ty Simpkins, Lin S...",2010,103,6.8,219916,53.99,52.0,bad
Taare Zameen Par,992,"Drama,Family,Music",An eight-year-old boy is thought to be a lazy ...,Aamir Khan,"Darsheel Safary, Aamir Khan, Tanay Chheda, Sac...",2007,165,8.5,102697,1.20,42.0,good
Nerve,128,"Adventure,Crime,Mystery",A high school senior finds herself immersed in...,Henry Joost,"Emma Roberts, Dave Franco, Emily Meade, Miles ...",2016,96,6.6,69651,38.56,58.0,bad
Hell or High Water,106,"Crime,Drama,Thriller",A divorced father and his ex-con older brother...,David Mackenzie,"Chris Pine, Ben Foster, Jeff Bridges, Gil Birm...",2016,102,7.7,115546,26.86,88.0,bad
In Bruges,753,"Comedy,Crime,Drama","Guilt-stricken after a job gone wrong, hitman ...",Martin McDonagh,"Colin Farrell, Brendan Gleeson, Ciarán Hinds,E...",2008,107,7.9,322536,7.76,67.0,bad
Centurion,921,"Action,Adventure,Drama",A splinter group of Roman soldiers fight for t...,Neil Marshall,"Michael Fassbender, Dominic West, Olga Kurylen...",2010,97,6.4,67801,0.12,62.0,bad
The Illusionist,728,"Drama,Mystery,Romance","In turn-of-the-century Vienna, a magician uses...",Neil Burger,"Edward Norton, Jessica Biel, Paul Giamatti, Ru...",2006,110,7.6,309934,39.83,68.0,bad
Vincent N Roxxy,308,"Crime,Drama,Thriller",A small town loner and a rebellious punk rocke...,Gary Michael Schultz,"Emile Hirsch, Zoë Kravitz, Zoey Deutch,Emory C...",2016,110,5.5,403,NaN,NaN,bad
Sleeping Beauty,649,"Drama,Romance","A haunting portrait of Lucy, a young universit...",Julia Leigh,"Emily Browning, Rachael Blake, Ewen Leslie, Br...",2011,101,5.3,27006,0.03,NaN,bad
Ted 2,668,"Adventure,Comedy,Romance",Newlywed couple Ted and Tami-Lynn want to have...,Seth MacFarlane,"Mark Wahlberg, Seth MacFarlane, Amanda Seyfrie...",2015,115,6.3,136323,81.26,48.0,bad
Transformers: Age of Extinction,127,"Action,Adventure,Sci-Fi",Autobots must escape sight from a bounty hunte...,Michael Bay,"Mark Wahlberg, Nicola Peltz, Jack Reynor, Stan...",2014,165,5.7,255483,245.43,32.0,bad
The Tree of Life,887,"Drama,Fantasy","The story of a family in Waco, Texas in 1956. ...",Terrence Malick,"Brad Pitt, Sean Penn, Jessica Chastain, Hunter...",2011,139,6.8,143517,13.30,85.0,bad

#### Pandas pipe

There is a great method to apply multiple transformation in an efficient and compact way: [`pipe`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.pipe.html).

The best way to illustrate it is through an example.

First let's define a bunch of function to apply. The important property is they must all have as parameter and return the dataframe.
You can see the pipe as a transformation map.

In [75]:
# Define functions

def remove_null(df_movies):
    """remove null values
    
    Parameters
    ----------
    df: pd.DataFrame
        the base dataframe
    
    Returns
    -------
    pd.DataFrame
        the dataframe with null values removed
    """
    return df_movies.dropna()

def drop_genre(df_movies, genre):
    """remove a specific genre movies
    
    Parameters
    ----------
    df: pd.DataFrame
        the base dataframe
    
    genre: str
        the movie genre to be removed.
    
    Returns
    -------
    pd.DataFrame
        the filtered dataframe 
    """
    series_remove = df_movies.genre.str.contains(f"{genre}") # Boolean series
    idx_to_drop = series_remove[series_remove].index # Find indices in the series and use them to drop rows from the dataframe
    print(f"Removing {len(idx_to_drop)} rows")
    print(idx_to_drop)
    return df_movies.drop(index=idx_to_drop)

We can easily build a pipeline over a dataframe by calling `pipe`.

In [ ]:
(df_movies.pipe(remove_null)
    .pipe(drop_genre, "Drama"))